app/views/books/index.html.erb

SELECT "books"."author" FROM "books"
---
    <%= f.label :author_eq, "Autor" %>
    <%= f.select :author_eq, Book.pluck(:author).uniq, include_blank: "Selecione um autor" %>

SELECT "books"."genre" FROM "books"
---
    <%= f.label :genre_eq, "Gênero" %>
    <%= f.select :genre_eq, Book.pluck(:genre).uniq, include_blank: "Selecione um gênero" %>

SELECT "books"."sub_genre" FROM "books"
---
    <%= f.label :sub_genre_eq, "Sub Gênero" %>
    <%= f.select :sub_genre_eq, Book.pluck(:sub_genre).uniq, include_blank: "Selecione um sub gênero" %>

SELECT "books".* FROM "books"
---
        <td>
          <% if book.book_cover.present? %>