app/controllers/books_controller.rb

    def index
      @books = Book.page(params[:page]).per(10) #substitui Books.all
---
SELECT "books".* FROM "books" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "books"

    def create
      @book = Book.new(book_params)
        if @book.save
---
INSERT INTO "books" ("title", "genre", "author", "year", "book_id", "created_at", "updated_at", "updated_by", "book_cover", "sub_genre") VALUES ('A Náusea', 'Romance', 'Jean-Paul Sartre', 1938, 'YJAN20124', '2024-12-01 16:54:07.829399', '2024-12-01 16:54:07.829399', NULL, NULL, 'Filosofia') RETURNING "id"

    def update
      if @book.update(book_params)
---
UPDATE "books" SET "updated_at" = '2024-12-02 22:59:43.098576' WHERE "books"."id" = 12

    def import_xls(file)
      spreadsheet = Roo::Spreadsheet.open(file.path)
      header = spreadsheet.row(1) # Primeira linha é o cabeçalho

      (2..spreadsheet.last_row).each do |i|
        row = Hash[[header, spreadsheet.row(i)].transpose]
        Book.create(row)
---
INSERT INTO "books" ("title", "genre", "author", "year", "book_id", "created_at", "updated_at", "updated_by", "book_cover", "sub_genre") VALUES ('A Idade da Razão', 'Romance', 'Jean-Paul Sartre', 1945, 'BCYI23604', '2024-12-01 17:44:29.493619', '2024-12-01 17:44:29.493619', NULL, NULL, 'Filosofia') RETURNING "id"